% THIS TEMPLATE IS A WORK IN PROGRESS

\documentclass[polish, a4paper]{article}
\usepackage[a4paper,left=3cm,right=3cm,top=3cm,bottom=1.5cm]{geometry}
\usepackage[T1]{fontenc}
\usepackage[polish]{babel}
\usepackage[utf8]{inputenc}
\usepackage{hyperref}
\usepackage{fancyhdr}
\usepackage{float}
\usepackage{graphicx}
\usepackage{titling}
\usepackage{wasysym}
\usepackage{caption}
\usepackage{pgfplots}
\usepackage{pgfplotstable}
\usepackage{filecontents}
\usepackage{csvsimple}
\usepackage{textcomp}
\usepackage{gensymb}
\usepackage{etoolbox}
%\usepackage{siunitx}
\graphicspath{ {./} }
\pagestyle{fancy}

\setlength{\droptitle}{-1in}

%\lhead{\includegraphics[width=0.2\textwidth]{nyush-logo.pdf}}

  \lhead{Maciej Kaszkowiak}
  \chead{Routing statyczny Cisco}
  \rhead{
  151856}


%%%% PROJECT TITLE
\title{Routing statyczny Cisco\\
        \Large \emph{Sprawozdanie nr 5 z przedmiotu Sieci Komputerowe}}

%%%% NAMES OF ALL THE STUDENTS INVOLVED (first-name last-name)
\author{Maciej Kaszkowiak, 151856, zadania wykonane 13 maja 2023}

\date{\vspace{-5ex}} %NO DATE


\begin{document}

\maketitle
%\thispagestyle{titlepage}

\tableofcontents

\newpage

\section{Zadanie 1}
\subsection{Wraz z koleżankami i kolegami połącz routery w łańcuch poprzez porty ethernetowe (kablami krosowanymi – czarnymi).}

Podłączyłem komputer nr 3 do portu konsoli routera nr 2 poprzez port nr 131.

Połączenie się udało:

\begin{figure}[H]
\begin{verbatim}
Cisco IOS Software, 2800 Software (C2800NM-ADVIPSERVICESK9-M), Version 12.4(15)T1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 06:21 by prod_rel_team
*Jan  1 01:01:38.935: %SNMP-5-COLDSTART: SNMP agent on host Router is undergoing a cold start
*Jan  1 01:01:39.155: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Jan  1 01:01:44.439: %DSPRM-5-UPDOWN: DSP 1 in slot 0, changed state to upr>
Router>
Router>
\end{verbatim}
\caption{Wykonana komenda}
\end{figure}

Router nr 2 podłączyłem za pomocą portu GigabitEthernet0/1 do routera nr 1.
Router nr 2 podłączyłem za pomocą portu GigabitEthernet0/0 do routera nr 3.

\subsection{Nadaj interfejsom odpowiednie adresy, zbadaj połączenia do sąsiednich routerów przy pomocy poleceń ping i show cdp neighbors.}

\begin{figure}[H]
\begin{verbatim}
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 10.1.0.2 255.255.0.0
Router(config-if)#no shutdown
Router(config-if)#
*Jan  1 01:12:13.091: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to up
*Jan  1 01:12:14.579: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
Router(config-if)#
\end{verbatim}
\caption{Konfiguracja interfejsu 0/1}
\end{figure}

\begin{figure}[H]
\begin{verbatim}
Router(config-if)#do ping 10.1.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
Router(config-if)#

\end{verbatim}
\caption{Test interfejsu 0/1}
\end{figure}

Pingi przechodzą do routera nr 1.

\begin{figure}[H]
\begin{verbatim}
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address 10.2.0.2 255.255.0.0
Router(config-if)#no shutdown
Router(config-if)#
*Jan  1 01:13:56.287: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to up
*Jan  1 01:13:57.867: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#
Router(config-if)#do ping 10.2.0.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.0.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

\end{verbatim}
\caption{Konfiguracja oraz test interfejsu 0/0}
\end{figure}

Pingi przechodzą również do routera nr 2.

\subsection{Dodaj routing statyczny do innych sieci.}

\begin{figure}[H]
\begin{verbatim}
Router(config)#ip route 0.0.0.0 0.0.0.0 10.2.0.3
Router(config)#do show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is 10.2.0.3 to network 0.0.0.0

     10.0.0.0/16 is subnetted, 2 subnets
C       10.2.0.0 is directly connected, GigabitEthernet0/0
C       10.1.0.0 is directly connected, GigabitEthernet0/1
S*   0.0.0.0/0 [1/0] via 10.2.0.3
\end{verbatim}
\caption{Konfiguracja oraz test interfejsu 0/0}
\end{figure}

Połączenia przechodzą zarówno do bezpośrednio połączonych sieci jak i do pozostałych sieci:

\begin{figure}[H]
\begin{verbatim}
Router(config)#do ping 10.3.0.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.3.0.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
Router(config)#do ping 10.1.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/4 ms
Router(config)#do ping 10.2.0.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.0.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
Router(config)#
\end{verbatim}
\caption{Test połączeń}
\end{figure}

\subsection{Zbadaj połączenia przy pomocy polecenia traceroute <adres> numeric.}

\begin{figure}[H]
\begin{verbatim}
Router(config)#do traceroute 10.3.0.4 numeric

Type escape sequence to abort.
Tracing the route to 10.3.0.4

  1 10.2.0.3 0 msec 0 msec 0 msec
  2 10.3.0.4 4 msec *  0 msec

Router(config)#do traceroute 10.7.0.8 numeric

Type escape sequence to abort.
Tracing the route to 10.7.0.8

  1 10.2.0.3 0 msec 4 msec 0 msec
  2 10.3.0.4 0 msec 0 msec 0 msec
  3 10.3.0.4 !H  *  !H 

\end{verbatim}
\caption{Test połączeń}
\end{figure}

Połączenia dochodzą do routera R3, zaś połączenie z dalszymi sieciami jest aktualnie niemożliwe ze względu na błędną konfigurację routera R4.

\begin{figure}[H]
\begin{verbatim}
Router(config)#do traceroute 10.5.0.6 numeric

Type escape sequence to abort.
Tracing the route to 10.5.0.6

  1 10.2.0.3 0 msec 4 msec 0 msec
  2 10.3.0.4 0 msec 0 msec 0 msec
  3 10.4.0.5 0 msec 4 msec 0 msec
  4  *  *  * 
  5  *  *  * 
\end{verbatim}
\caption{Test połączeń}
\end{figure}

Po naprawieniu konfiguracji routera R4, router R5 okazał się mieć błędną konfigurację.

\end{document}